ConnectTest/src/InformationRegisters/ordersStates/ordersStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ordersStates</name>
  <resources>
    <name>state</name>
    <type>
      <types>EnumRef.acquiringOrderStates</types>
    </type>
  </resources>
  <dimensions>
    <name>order</name>
    <type>
      <types>CatalogRef.acquiringOrders</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Enums/acquiringOrderStates/acquiringOrderStates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>acquiringOrderStates</name>
  <enumValues>
    <name>send</name>
  </enumValues>
  <enumValues>
    <name>success</name>
  </enumValues>
  <enumValues>
    <name>rejected</name>
  </enumValues>
  <enumValues>
    <name>done</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/acquiringRequests/acquiringRequests.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>acquiringRequests</name>
  <enumValues>
    <name>register</name>
  </enumValues>
  <enumValues>
    <name>registerPreAuth</name>
  </enumValues>
  <enumValues>
    <name>binding</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/JSONValueTypes/JSONValueTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>JSONValueTypes</name>
	<enumValues>
		<name>string</name>
	</enumValues>
	<enumValues>
		<name>number</name>
	</enumValues>
	<enumValues>
		<name>date</name>
	</enumValues>
	<enumValues>
		<name>boolean</name>
	</enumValues>
	<enumValues>
		<name>structure</name>
	</enumValues>
	<enumValues>
		<name>array</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/acquiringOrders/acquiringOrders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>acquiringOrders</name>
  <attributes>
    <name>acquiringAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>acquiringProvider</name>
    <type>
      <types>EnumRef.acquiringProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>acquiringRequest</name>
    <type>
      <types>EnumRef.acquiringRequests</types>
    </type>
  </attributes>
  <attributes>
    <name>amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>creditCard</name>
    <type>
      <types>CatalogRef.creditCards</types>
    </type>
  </attributes>
  <attributes>
    <name>gym</name>
    <type>
      <types>CatalogRef.gyms</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <attributes>
    <name>contract</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>connectionType</name>
    <type>
      <types>EnumRef.ConnectionTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>cards</name>
    <attributes>
      <name>card</name>
      <type>
        <types>CatalogRef.creditCards</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>deposits</name>
    <attributes>
      <name>owner</name>
      <type>
        <types>CatalogRef.users</types>
      </type>
    </attributes>
    <attributes>
      <name>type</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>balance</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>min</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>max</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>orders</name>
    <attributes>
      <name>uid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>type</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>payments</name>
    <attributes>
      <name>owner</name>
      <type>
        <types>CatalogRef.users</types>
      </type>
    </attributes>
    <attributes>
      <name>type</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>details</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/CommonModules/Internal_API_Payment/Module.bsl
Procedure processOrder(parameters, additionalParameters) Export
	
	query = New Query("SELECT
	|	acquiringOrders.orders.(
	|		uid AS uid) AS orders,
	|	acquiringOrders.payments.(
	|		owner AS owner,
	|		type AS type,
	|		amount AS amount,
	|		details AS details) AS payments,
	|	acquiringOrders.acquiringRequest AS acquiringRequest,
	|	ordersStates.state
	|FROM
	|	Catalog.acquiringOrders AS acquiringOrders
	|		LEFT JOIN InformationRegister.ordersStates AS ordersStates
	|		ON ordersStates.order = acquiringOrders.Ref
	|WHERE
	|	acquiringOrders.Ref = &order
	|	AND ordersStates.state in (VALUE(Enum.acquiringOrderStates.success), VALUE(Enum.acquiringOrderStates.rejected))");
	
	query.SetParameter("order", parameters.order);
	
	result = query.Execute();
	
	If Not result.IsEmpty() Then		
		parametersNew = Service.getStructCopy(additionalParameters);
		requestStruct = New Structure();
		select = result.Select();
		select.Next();		
		If select.acquiringRequest = Enums.acquiringRequests.register Then			
			requestStruct.Insert("request", ?(select.state = Enums.acquiringOrderStates.success,"payment","cancel"));
			requestStruct.Insert("uid", XMLString(parameters.order));
			requestStruct.Insert("docList", select.orders.Unload().UnloadColumn("uid"));
			paymentList = New Array();
			For Each row In select.payments.Unload() Do
				paymentListStruct = New Structure();
				paymentListStruct.Insert("owner", XMLString(row.owner));
				paymentListStruct.Insert("type", row.type);
				paymentListStruct.Insert("amount", row.amount);
				paymentListStruct.Insert("details", HTTP.decodeJSON(row.details, Enums.JSONValueTypes.structure));
				paymentList.Add(paymentListStruct);
			EndDo;
			requestStruct.Insert("paymentList", paymentList);
			parametersNew.Insert("requestName", "paymentBack");			
		EndIf;
		parametersNew.Insert("requestStruct", requestStruct);
		Acquiring.delOrderToQueue(parameters.order);
		General.executeRequestMethod(parametersNew);		
		If parametersNew.errorDescription.result <> "" Then
			Acquiring.addOrderToQueue(parameters.order, select.state);
			parameters.Insert("errorCode", parametersNew.errorDescription.result);
			parameters.Insert("response", parametersNew.errorDescription.description);	
		EndIf;		
	EndIf;	
	
EndProcedure

Procedure bindCard(parameters, additionalParameters) Export
	query = New Query("SELECT
	|	acquiringOrders.creditCard,
	|	acquiringOrders.creditCard.Owner AS userId,
	|	acquiringOrders.creditCard.acquiringBank AS acquiringBank,
	|	acquiringOrders.creditCard.autopayment AS autopayment,
	|	acquiringOrders.creditCard.expiryDate AS expiryDate,
	|	acquiringOrders.creditCard.ownerName AS ownerName,
	|	acquiringOrders.creditCard.paymentSystem AS paymentSystem
	|FROM
	|	Catalog.acquiringOrders AS acquiringOrders
	|WHERE
	|	acquiringOrders.Ref = &order");
	query.SetParameter("order", parameters.order);
	
	result = query.Execute();
	If Not result.IsEmpty() Then		
		parametersNew = Service.getStructCopy(additionalParameters);
		requestStruct = New Structure();
		select = result.Select();
		select.Next();				
		requestStruct.Insert("uid", 								XMLString(select.creditCard));
		requestStruct.Insert("userId", 							XMLString(select.userId));
	    requestStruct.Insert("acquiringBank", 			select.acquiringBank);
	    requestStruct.Insert("autopayment", 			select.autopayment);
	    requestStruct.Insert("expiryDate", 					select.expiryDate);
	    requestStruct.Insert("ownerName",				select.ownerName);
	    requestStruct.Insert("paymentSystem",		String(select.paymentSystem));
	    
		Acquiring.delOrderToQueue(parameters.order);
		General.executeRequestMethod(parametersNew);		
		If parametersNew.errorDescription.result <> "" Then
			Acquiring.addOrderToQueue(parameters.order, Enums.acquiringOrderStates.success);
			parameters.Insert("errorCode", parametersNew.errorDescription.result);
			parameters.Insert("response", parametersNew.errorDescription.description);	
		EndIf;		
	EndIf;	
EndProcedure

Procedure unBindCard(parameters, additionalParameters) Export
		
	If ValueIsFilled(parameters.order.creditCard) Then
		parametersNew = Service.getStructCopy(additionalParameters);
		requestStruct = New Structure();
		requestStruct.Insert("uid", XMLString(parameters.order.creditCard));
		Acquiring.delOrderToQueue(parameters.order);
		General.executeRequestMethod(parametersNew);		
		If parametersNew.errorDescription.result <> "" Then
			Acquiring.addOrderToQueue(parameters.order, Enums.acquiringOrderStates.success);
			parameters.Insert("errorCode", parametersNew.errorDescription.result);
			parameters.Insert("response", parametersNew.errorDescription.description);	
		EndIf;	
	EndIf;
	
EndProcedure
